package lesson04;

public class Task03 {
    /*
     Объявите две переменные для длин сторон прямоугольника.
      Напишите код для вычисления периметра прямоугольника
      и выведите результат.
     */
    public static void main(String[] args) {
        double length = 12.5;
        double width = 6.5;
        double perimetr = 2*(length + width);
        System.out.println(perimetr);
    }
}
